Revit 2026 API

# StructuralElementDefinitionData Class

---

Class containing information about section and position of the structural element.

SystemObject Autodesk.Revit.DB.Structure.StructuralSectionsStructuralElementDefinitionData

**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class StructuralElementDefinitionData : IDisposable
```
```vb
Public Class StructuralElementDefinitionData
	Implements IDisposable
```
```cpp
public ref class StructuralElementDefinitionData : IDisposable
```
```fsharp
type StructuralElementDefinitionData =
    class
        interface IDisposable
    end
```

The StructuralElementDefinitionData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | StructuralElementDefinitionData | Creates empty StructuralElementDefinitionData object. |

|  | Name | Description |
| --- | --- | --- |
|  | CenterCurve | The curve lying in the geometrical center of the element. |
|  | Curve | The definition curve of the element. |
|  | EndShortening | Cutback or extension at element curve end. |
|  | IsMirrored | States if the structural section of the element is mirrored. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Normal | The local Z direction of the element section in the start point of the curve. |
|  | Section | Structural section of the element. |
|  | StartShortening | Cutback or extension at element curve start. |
|  | YJust | Y justification (ref axis). |
|  | YOffset | Y offset. |
|  | ZJust | Z justification (ref axis). |
|  | ZOffset | Z offset. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the StructuralElementDefinitionData |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Structure.StructuralSections Namespace